PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.h
#ifndef RTOS_INCLUDED
#define RTOS_INCLUDED
/**
 * @file rtos.h
 * Definition of global interface of module rtos.c
 *
 * Copyright (C) 2017-2019 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   rtos_OS_runTask
 *   rtos_terminateTask
 *   rtos_OS_suspendAllInterruptsByPriority
 *   rtos_suspendAllInterruptsByPriority
 *   rtos_OS_resumeAllInterruptsByPriority
 *   rtos_resumeAllInterruptsByPriority
 *   rtos_triggerEvent
 *   rtos_getNoTotalTaskFailure
 *   rtos_getNoTaskFailure
 *   rtos_suspendProcess
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <limits.h>

#include "MPC5643L.h"
#include "typ_types.h"
#include "ihw_initMcuCoreHW.h"
#include "pcp_sysCallPCP.h"
#include "prc_process.h"
#include "ivr_ivorHandler.h"


/*
 * Defines
 */

/** The period time of the RTOS system timer. Unit is 1ms. */
#define RTOS_CLOCK_TICK_IN_MS       1 /* ms */

/** Priority of the scheduler. Normally this priority is the highest one in use but not
    necessarily. All user code needs to run at lower priority. Interrupts of same or higher
    priority may exist but they cannot have a secured callback into user code (no deadline
    monitoring) and user code cannot create a critical section with them. This makes them
    somewhat difficult in use. */
#define RTOS_KERNEL_PRIORITY        12

/** A user task is activated by an event. The implementation of events as software
    interrupts limits their maximum number to eight. Note, this is not a configuration
    setting, the value cannot be changed. */
#define RTOS_MAX_NO_EVENTS          8

/** The maximum number of user tasks, which can be activated by an event. The chosen number
    is a compile time configuration setting and there are no constraints in changing it
    besides the ammout of reserved RAM space for the resulting table size.\n
      The configured limit applies to the tasks registered with rtos_registerTask() only;
    callbacks from I/O driver, which are much of a user task, too, are not couted here. */
#define RTOS_MAX_NO_USER_TASKS      20

/** Deadline monitoring for tasks is supported up to a task maximum execution time of this
    number of Microseconds: (2^31-1)*T_c/1e-6, T_c is 120e6 (CPU clock rate). */
#define RTOS_TI_DEADLINE_MAX_IN_US  17895697

/** A pseudo event ID. Used to register a process initialization task in the API
    rtos_registerTask(). */
#define RTOS_EVENT_ID_INIT_TASK     (UINT_MAX)

/** An RTOS event can normally be triggered by user tasks belonging to a process of
    sufficient privileges. See field \a minPIDToTriggerThisEvent of struct \a
    rtos_eventDesc_t. If it should not be accessible even by the process of highest
    priviledges than #PRC_EVENT_NOT_USER_TRIGGERABLE can be specified for \a
    minPIDToTriggerThisEvent. */
#define PRC_EVENT_NOT_USER_TRIGGERABLE  ((PRC_NO_PROCESSES)+1u)


/**
 * System call wrapper; entry point into operating system function for user code.\n
 *   This macro doesn't really add functionality. It has only been shaped to make an entry
 * point into the assembly code accessible as C style function call and within the
 * expected namespace.
 *   @return
 * The return value depends on the system call.
 *   @param idxSysCall
 * Each system call is identified by an index. The index is an unsigned integer. The number
 * is the index into system call descriptor table \a sc_systemCallDescAry.\n
 *   The further function arguments depend on the particular system call.
 *   @remark
 * The C signature for system calls is formally not correct. The assembly code only
 * supports function arguments in CPU registers, which limits the total number to eight.
 * The ... stands for 0..7 arguments of up to 32 Bit. If a system call function has more
 * arguments or if it are 64 Bit arguments then the assembly code may not propagate all
 * arguments properly to the actually implementing system call handler and the behavior
 * will be undefined!
 */
#define /*uint32_t*/ rtos_systemCall(/*uint32_t*/ idxSysCall, ...) \
                                                ivr_systemCall(idxSysCall, __VA_ARGS__)

/**
 * Wrapper for the call of function void prc_grantPermissionSuspendProcess(unsigned int
 * pidOfCallingTask, unsigned int targetPID) in order to have the function in the name
 * space rtos_*. See prc_grantPermissionSuspendProcess() for details.
 */
#define /*void*/ rtos_grantPermissionSuspendProcess( /*unsigned int*/ pidOfCallingTask  \
                                                   , /*unsigned int*/ targetPID         \
                                                   )                                    \
                            prc_grantPermissionSuspendProcess(pidOfCallingTask, targetPID)

/** System call index of function rtos_triggerEvent(), offered by this module. */
#define RTOS_SYSCALL_TRIGGER_EVENT  5

/** System call index of function rtos_runTask(), offered by this module. */
#define RTOS_SYSCALL_RUN_TASK       10


/*
 * Global type definitions
 */

/** User visible description of an event. An object of this type is used by the client code
    of the RTOS to create an event. (It is not used at runtime in the kernel, see event_t
    instead.) */
typedef struct rtos_eventDesc_t
{
    /** The period time for regularly triggering event in ms.\n
          The permitted range is 0..2^30-1. 0 means no regular, timer controlled trigger
        and the event is only enabled for software trigger using rtos_triggerEvent()
        (permitted for interrupts or other tasks). */
    unsigned int tiCycleInMs;

    /** The first trigger of the event in ms after start of kernel. The permitted range
        is 0..2^30-1.\n
          Note, this setting is useless if a cycle time zero in \a tiCycleInMs
        specifies a non regular event. \a tiFirstActivationInMs needs to be zero in this
        case, too. */
    unsigned int tiFirstActivationInMs;

    /** The priority of the event in the range 1..(#RTOS_KERNEL_PRIORITY-1). Different
        events can share the same priority or have different priorities. The priotrity of
        an event is the priority of all associated tasks at the same time. The execution of
        tasks, which share the priority will be sequenced when they are activated at same
        time or with overlap.\n
          Note the safety constraint that the highest permitted priority,
        #RTOS_KERNEL_PRIORITY-1, is available only to events, which solely have tasks
        associated that belong to the process with highest process ID in use. */
    unsigned int priority;

    /** An event can be triggered by user code, using rtos_triggerEvent(). However, tasks
        belonging to less privileged processes must not generally granted permission to
        trigger events that may activate tasks of higher privileged processes. Since an
        event is not process related, we make the minimum process ID an explicitly configured,
        which is required to trigger this event.\n
          Only tasks belonging to a process with PID >= \a minPIDToTriggerThisEvent are
        permitted to trigger this event.\n
          The range of \a minPIDToTriggerThisEvent is 0 ... (#PRC_NO_PROCESSES+1). 0 and 1
        both mean, all processes may trigger the event, #PRC_NO_PROCESSES+1 means only OS code
        can trigger the event. #PRC_NO_PROCESSES+1 is available as
        #PRC_EVENT_NOT_USER_TRIGGERABLE, too. */
    unsigned int minPIDToTriggerThisEvent;

} rtos_eventDesc_t;


/** User visible description of a task. An object of this type is used by the client code
    of the RTOS to register a task. (It is not used at runtime in the kernel, see
    prc_processDesc_t and prc_userTaskConfig_t instead.) */
typedef struct rtos_taskDesc_t
{
    /** The process the task belongs to by identifier. We have a fixed, limited number of
        four processes plus the kernel process, which has ID 0. The range of of process IDs
        to be used here is 1 .. 4.\n
          Note, the stack area for a process is configured in the linker script. To save
        RAM if a process is not use, its stack size shall be configured zero in the linker
        script. Double-check that this is not the case for any process used here. */
    unsigned int PID;

