PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.h
    /** The task function pointer. Note the different function signatures for task
        functions used in different contexts. */
    union
    {
        /** This is the prototype to be used for normal user tasks and for process
            initialization tasks, which may return a value. The specified function is
            executed under control of the RTOS kernel whenever the event trigger, which the
            task is associated with.\n
              If a user task returns a negative value then it is counted in the process
            (and after a number of errors a supervisory task could force a shutdown of the
            process).\n
              If a process init task returns a negative value then the system won't
            startup. */
        int32_t (*userTaskFct)(uint32_t PID);

        /** An event can have a task associated, which is used for the operating system. It
            is run as a normal function call, without supervision. The return value is
            meaningful only if the task is an initialization task: If the return value is
            negative then the system won't startup. */
        int32_t (*osTaskFct)(void);
    };

    /** Time budget for the user task in Microseconds. This budget is granted for each
        activation of the task. The budget relates to deadline monitoring, i.e. it is a
        world time budget, not an execution time budget.\n
          Deadline monitoring is supported up to a maximum execution time of
        #RTOS_TI_DEADLINE_MAX_IN_US Microseconds.\n
          A value of zero means that deadline monitoring is disabled for the task.\n
          There's no deadline monitoring for OS tasks. If \a PID is zero then \a
        tiTaskMaxInUS meeds to be zero, too. */
    uint32_t tiTaskMaxInUS;

} rtos_taskDesc_t;



/*
 * Global data declarations
 */


/*
 * Global prototypes
 */

/** Creation of an event. The event can be cyclically triggering or software triggerd. */
unsigned int rtos_createEvent(const rtos_eventDesc_t *pEventDesc);

/** Task registration. */
bool rtos_registerTask(const rtos_taskDesc_t *pTaskDesc, unsigned int idEvent);

/** Grant permission to particular processes for using the service rtos_runTask(). */
void rtos_grantPermissionRunTask(unsigned int pidOfCallingTask, unsigned int targetPID);

/** Kernel initialization. */
bool rtos_initKernel(void);

/** Software triggered task activation. Can be called from OS context (incl. interrupts). */
bool rtos_OS_triggerEvent(unsigned int idTask);

/** Get the current number of failed task activations since start of the RTOS scheduler.
    Can be called from OS context (incl. interrupts). */
unsigned int rtos_OS_getNoActivationLoss(unsigned int idTask);

/** Compute how many bytes of the stack area are still unused. */
unsigned int rtos_OS_getStackReserve(unsigned int PID);

/** Get the current number of failed task activations since start of the RTOS scheduler. */
unsigned int rtos_getNoActivationLoss(unsigned int idTask);

/** Compute how many bytes of the stack area are still unused. */
unsigned int rtos_getStackReserve(unsigned int PID);


/*
 * Inline functions
 */

/**
 * Start a user task. A user task is a C function, which is executed in user mode and in a
 * given process context. The call is synchronous; the calling OS cpontext is immediately
 * preempted and superseded by the started task. The calling OS context is resumed when the
 * task function ends - be it gracefully or by exception/abortion.\n
 *   The started task inherits the priority of the calling OS context. It can be preempted
 * only by contexts of higher priority.
 *   @return
 * The executed task function can return a value, which is propagated to the calling OS
 * context if it is positive. A returned negative task function result is interpreted as
 * failing task and rtos_OS_runTask() returns #IVR_CAUSE_TASK_ABBORTION_USER_ABORT instead.
 * Furthermore, this event is counted as process error in the target process.
 *   @param pTaskConfig
 * The read-only configuration data for the task. In particular the task function pointer
 * and the ID of the target process.
 *   @param pTaskParam
 * This argument is meaningless to the function. The value is just passed on to the started
 * task function. The size is large enough to convey a pointer.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 */
static inline int32_t rtos_OS_runTask( const prc_userTaskConfig_t *pUserTaskConfig
                                     , uintptr_t taskParam
                                     )
{
    /* The function is assembler implemented, the C function is just a wrapper for
       convenient calling within the expected namespace. */
    return ivr_runUserTask(pUserTaskConfig, taskParam);

} /* End of rtos_OS_runTask */


/**
 * Start a user task. A user task is a C function, which is executed in user mode and in a
 * given process context. The call is synchronous; the calling user context is immediately
 * preempted and superseded by the started task. The calling user context is resumed when the
 * task function ends - be it gracefully or by exception/abortion.\n
 *   The started task inherits the priority of the calling OS context. It can be preempted
 * only by contexts of higher priority.\n
 *   The function requires sufficient privileges. The invoking task needs to belong to a
 * process with an ID greater then the target process. The task cannot be started in the OS
 * context.\n
 *   The function cannot be used recursively. The created task cannot in turn make use of
 * rtos_OS_runTask().
 *   @return
 * The executed task function can return a value, which is propagated to the calling user
 * context if it is positive. A returned negative task function result is interpreted as
 * failing task and rtos_runTask() returns #IVR_CAUSE_TASK_ABBORTION_USER_ABORT instead.
 * Furthermore, this event is counted as process error in the target process.
 *   @param pTaskConfig
 * The read-only configuration data for the task. In particular the task function pointer
 * and the ID of the target process.
 *   @param pTaskParam
 * This argument is meaningless to the function. The value is just passed on to the started
 * task function. The size is large enough to convey a pointer.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 */
static inline int32_t rtos_runTask( const prc_userTaskConfig_t *pUserTaskConfig
                                  , uintptr_t taskParam
                                  )
{
    return (int32_t)rtos_systemCall(RTOS_SYSCALL_RUN_TASK, pUserTaskConfig, taskParam);

