PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.h
} /* End of rtos_runTask */


/**
 * Abort the calling task immediately. A user task may use this system call at any time and
 * from any nested sub-routine. The task execution is immediately aborted. The function
 * does not return.
 *   @param taskReturnValue
 * The task can return a value to its initiator, i.e. to the context who had applied
 * ivr_runUserTask() or ivr_runInitTask() to create the task. The value is signed and
 * (only) the sign is meanigful to the assembly code to create/abort a task:\n
 *   Requesting task abortion is considered an error and counted in the owning process if
 * the returned value is negative. In this case, the calling context won't receive the
 * value but the error code #IVR_CAUSE_TASK_ABBORTION_USER_ABORT.\n
 *   Requesting task abortion is not considered an error if \a taskReturnValue is greater
 * or equal to zero. The value is propagated to the task creating context.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline _Noreturn void rtos_terminateTask(int32_t taskReturnValue)
{
    ivr_terminateUserTask(taskReturnValue);

} /* End of rtos_terminateTask */



/**
 * Priority ceiling protocol, partial interrupt lock: All interrupts up to the specified
 * priority level won't be handled by the CPU. This function is intended for implementing
 * mutual exclusion of sub-sets of tasks; the use of
 *   - ihw_enterCriticalSection() and
 *   - ihw_leaveCriticalSection()
 * or
 *   - ihw_suspendAllInterrupts() and
 *   - ihw_resumeAllInterrupts()
 * locks all interrupt processing and no other task (or interrupt handler) can become
 * active while the task is inside the critical section code. Using this function is much
 * better: Call it with the highest priority of all tasks, which should be locked, i.e. which
 * compete for the critical section to protect. This may still lock other, not competing
 * tasks, but at least all non competing tasks of higher priority will still be served (and
 * this will likely include most interrupt handlers).\n
 *   To leave the critical section, call the counterpart function
 * rtos_resumeAllInterruptsByPriority(), which restores the original interrupt/task
 * priority level.
 *   @return
 * The priority level at entry into this function (and into the critical section) is
 * returned. This level needs to be restored on exit from the critical section using
 * rtos_resumeAllInterruptsByPriority().
 *   @param suspendUpToThisPriority
 * All tasks/interrupts up to and including this priority will be locked. The CPU will
 * not handle them until the priority level is lowered again.
 *   @remark
 * To support the use case of nested calls of OSEK/VDX like GetResource/ReleaseResource
 * functions, this function compares the stated value to the current priority level. If \a
 * suspendUpToThisPriority is less than the current value then the current value is not
 * altered. The function still returns the current value and the calling code doesn't need
 * to take care: It can unconditionally end a critical section with
 * rtos_resumeAllInterruptsByPriority() stating the returned priority level value. (The
 * resume function will have no effect in this case.) This makes the OSEK like functions
 * usable without deep inside or full transparency of the priority levels behind the scene;
 * just use the pairs of Get-/ResumeResource, be they nested or not.
 *   @remark
 * The expense in terms of CPU consumption of using this function instead of the others
 * mentioned above is negligible for all critical section code, which consists of more than a
 * few machine instructions.
 *   @remark
 * The use of this function to implement critical sections is usually quite static. For any
 * protected entity (usually a data object or I/O device) the set of competing tasks
 * normally is a compile time known. The priority level to set for entry into the critical
 * section is the maximum of the priorities of all tasks in the set. The priority level to
 * restore on exit from the critical section is the priority of the calling task. All of
 * this static knowledge would typically be put into encapsulating macros that actually
 * invoke this function. (OSEK/VDX like environments would use this function pair to
 * implement the GetResource/ReleaseResource concept.)
 *   @remark
 * The ceiled priority is implicitly restored at the end of the interrupt, which triggered
 * the task and before it ends. It is not possible to consider this function a mutex, which
 * can be acquired in one task activation and which can be releases in an arbitrary later
 * task activation or from another task.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 *   @remark
 * This function requires that msr[EE]=1 on entry.
 */
static inline uint32_t rtos_OS_suspendAllInterruptsByPriority(uint32_t suspendUpToThisPriority)
{
    /* All priorities are in the range 0..15. Everything else points to an application
       error even if the hardware wouldn't mind. */
    assert((suspendUpToThisPriority & ~0xfu) == 0);

    /* MCU reference manual, section 28.6.6.2, p. 932: The change of the current priority
       in the INTC should be done under global interrupt lock. */
    ihw_suspendAllInterrupts();
    uint32_t priorityLevelSoFar = INTC.CPR_PRC0.R;

    /* It is useless and a waste of CPU but not a severe error to let this function set the
       same priority level we already have.
         It leads to immediate failure of the RTOS if we lower the level; however, from the
       perspective of the application code it is not necessarily an error to do so: If an
       application is organized in OSEK/VDX like resources it may be stringent (not
       optimal) to acquire different resources before an operation on them is started. These
       resources may be mapped onto different priority ceilings and the application may use
       nested calls of GetResource to acquire all of them. We must not force the
       application code to order the calls in order of increasing priority ceiling -- this
       will be untransparent to the application.
         These considerations leads to different strategies, and all of them are justified:
         To force the application be optimal in terms of CPU consumption, we would place an
       assertion: assert(suspendUpToThisPriority > priorityLevelSoFar);
         To be relaxed about setting the same priority ceiling, we would place another
       assertion: assert(suspendUpToThisPriority >= priorityLevelSoFar);
         If we want to build an OSEK/VDX like GetResource on top of this function, we
       should place a run-time condition: if(suspendUpToThisPriority > priorityLevelSoFar) */
    //assert(suspendUpToThisPriority > priorityLevelSoFar);
    //assert(suspendUpToThisPriority >= priorityLevelSoFar);
    if(suspendUpToThisPriority > priorityLevelSoFar)
        INTC.CPR_PRC0.R = suspendUpToThisPriority;

    /* Leave the critical section. */
    ihw_resumeAllInterrupts();

