PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/system/RTOS/rtos.h
    /* Note, the next interrupt can still be a last one of priority less than or equal to
       suspendUpToThisPriority. This happens occasionally when the interrupt has asserted,
       while we were inside the critical section. Incrementing CPR does not un-assert an
       already asserted interrupt. The isync instruction ensures that this last interrupt
       has completed prior to the execution of the first code inside the critical section.
       See https://community.nxp.com/message/993795 for more. */
    asm volatile (
#ifdef __VLE__
                   "se_isync\n"
#else
                   "isync\n"
#endif
                   ::: "memory"
                 );

    return priorityLevelSoFar;

} /* End of rtos_OS_suspendAllInterruptsByPriority */



/**
 * See function rtos_OS_suspendAllInterruptsByPriority(), which has the same functionality
 * but offered to the OS context only. Differences to the OS function are:\n
 *   The priority can be raised only up to #RTOS_KERNEL_PRIORITY-2. An attempt to raise it
 * beyond this limit will lead to an #IVR_CAUSE_TASK_ABBORTION_SYS_CALL_BAD_ARG exception.
 * Safety rationale: A critical section cannot be shaped with the RTOS scheduler and nor
 * with the user task of highest priority. The intention is to inhibit a task from blocking
 * a safety task, which is assumed to be the only task running at highest priority.
 *   @return
 * Get the priority level at entry into this function (and into the critical section). This
 * priority level needs to be restored on exit from the critical section using system call
 * rtos_resumeAllInterruptsByPriority().
 *   @param suspendUpToThisPriority
 * \a suspendUpToThisPriority is the aimed priority level. All tasks/interrupts up to and
 * including this priority will be locked. The CPU will not handle them until the priority
 * level is lowered again.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline uint32_t rtos_suspendAllInterruptsByPriority(uint32_t suspendUpToThisPriority)
{
    return rtos_systemCall( PCP_SYSCALL_SUSPEND_ALL_INTERRUPTS_BY_PRIORITY
                          , suspendUpToThisPriority
                          );
} /* End of rtos_suspendAllInterruptsByPriority */




/**
 * This function is called to end a critical section of code, which requires mutual
 * exclusion of two or more tasks/ISRs. It is the counterpart of function
 * rtos_suspendAllInterruptsByPriority(), refer to this function for more details.\n
 *   Note, this function simply and unconditionally sets the current task/interrupt
 * priority level to the stated value. It can therefore be used to build further optimized
 * mutual exclusion code if it is applied to begin \a and to end a critical section. This
 * requires however much more control of the specified priority levels as when using the
 * counterpart function rtos_suspendAllInterruptsByPriority() on entry. Accidental
 * temporary lowering of the level will make the RTOS immediately fail.
 *   @param resumeDownToThisPriority
 * All tasks/interrupts above this priority level are resumed again. All tasks/interrupts
 * up to and including this priority remain locked.
 *   @remark
 * An application can (temporarily) rise the current priority level of handled tasks/ISRs
 * but must never lower them, the RTOS would fail: The hardware bit, that notified the
 * currently executing task/interrupt will be reset only at the end of the service routine,
 * so it is still pending. At the instance of lowering the priority level, the currently
 * executed task/ISR would be recursively called again. Furthermore, the INTC-internal
 * priority stack could easily overflow.
 *   @remark
 * This function must be called from the OS context only. Any attempt to use it in user
 * code will lead to a privileged exception.
 *   @remark
 * This function requires that msr[EE]=1 on entry.
 */
static inline void rtos_OS_resumeAllInterruptsByPriority(uint32_t resumeDownToThisPriority)
{
    /* MCU reference manual, section 28.6.6.2, p. 932: The change of the current priority
       in the INTC should be done under global interrupt lock. */
    ihw_suspendAllInterrupts();
    INTC.CPR_PRC0.R = resumeDownToThisPriority;
    ihw_resumeAllInterrupts();

} /* End of rtos_OS_resumeAllInterruptsByPriority */



/**
 * See function rtos_OS_resumeAllInterruptsByPriority(), too, which has the same
 * functionality but offered to the OS context only. Differences to the OS function are:\n
 *   The priority can be raised only down to the initial task priority. An attempt to lower
 * it belower than the initial task priority will lead to an
 * #IVR_CAUSE_TASK_ABBORTION_SYS_CALL_BAD_ARG exception.
 *   @param resumeDownToThisPriority
 * All tasks/interrupts above this priority level are resumed again. All tasks/interrupts
 * up to and including this priority remain locked.\n
 *   The intended use of this function is to restore the priority level of a task after use
 * of a resource, which had been protected by an earlier call of the counterpart function
 * rtos_suspendAllInterruptsByPriority(). Normally, \a resumeDownToThisPriority will be set
 * to the value returned by the other function.
 *   @remark
 * It doesn't harm if a user tasks calls rtos_suspendAllInterruptsByPriority() to raise the
 * priority but doesn't lower it later using this function. The effect of
 * rtos_suspendAllInterruptsByPriority() will end with the termination of the task.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline void rtos_resumeAllInterruptsByPriority(uint32_t resumeDownToThisPriority)
{
    rtos_systemCall(PCP_SYSCALL_SUSPEND_ALL_INTERRUPTS_BY_PRIORITY, resumeDownToThisPriority);

} /* End of rtos_resumeAllInterruptsByPriority */



/**
 * Trigger an event to activate all associated tasks. A event, which had been registered
 * with cycle time zero is normally not executed. It needs to be triggered with this
 * function in order to make its associated tasks run once, i.e. to make its task functions
 * exceuted once as result of this call.\n
 *   This function must only be called from user tasks, which belong to a process with
 * sufficient privileges. The operation is permitted only for tasks belonging to those
 * processes, which have an ID that is greater of equal to the minimum specified for the
 * event in question. Otherwise an exception is raised, which aborts the calling task.\n
 *   If the calling task belongs to the set of tasks associated with \a idEvent, then it'll
 * have no effect but an accounted activation loss; an event can re-triggered only after
 * all associated activations have been completed. There is no activation queuing. The
 * function returns \a false in this case.\n
 *   Note, the system respects the priorities of the activated tasks. If a task of priority
 * higher than the activating task is activated by the triggered event then the activating
 * task is immediately preempted to the advantage of the activated task. Otherwise the
 * activated task is chained and executed after the activating task.
 *   @return
 * There is no activation queuing. If the aimed event is not yet done with processing its
 * previous triggering then the attempt is rejected. The function returns \a false and the
 * activation loss counter of the event is incremented. (See rtos_getNoActivationLoss().)
 *   @param idEvent
 * The ID of the event to activate as it had been got by the creation call for that event.
 * (See rtos_createEvent().)
 *   @remark
 * The function is indented to start a non cyclic task by application software trigger but
 * can be applied to cyclic tasks, too. In which case the task function of the cyclic task
 * would be invoked once additionally. Note, that an event activation loss is not unlikely
 * in this case; the cyclic task may currently be busy.
 *   @remark
 * It is not forbidden but useless to let a task activate itself by triggering the event it
 * is associated with. This will have no effect besides incrementing the activation loss
 * counter for that event.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline bool rtos_triggerEvent(unsigned int idEvent)
{
    return (bool)rtos_systemCall(RTOS_SYSCALL_TRIGGER_EVENT, idEvent);

} /* End of rtos_triggerEvent */


/**
 * Get the number of task failures (and task abortions at the same time) counted for the
 * given process since start of the kernel.
 *   @return
 * Get total number of errors counted for process \a PID.
 *   @param PID
 * The ID of the queried process in the range 1 .. PRC_NO_PROCESSES. An out of range PID
 * will always yield UINT_MAX.
 *   @remark
 * This function can be called from both, a user task or the OS context.
 */
static inline unsigned int rtos_getNoTotalTaskFailure(unsigned int PID)
{
    if(--PID < PRC_NO_PROCESSES)
        return prc_processAry[PID].cntTotalTaskFailure;
    else
        return UINT_MAX;

} /* End of rtos_getNoTotalTaskFailure */



/**
 * Get the number of task failures of given category counted for the given process since
 * start of the kernel.
 *   @return
 * Get total number of errors of category \a kindOfErr counted for process \a PID.
 *   @param PID
 * The ID of the queried process in the range 1 .. PRC_NO_PROCESSES. An out of range PID
 * will always yield UINT_MAX.
 *   @param kindOfErr
 * The category of the error. See file ivr_ivorHandler.h,
 * #IVR_CAUSE_TASK_ABBORTION_MACHINE_CHECK and following, for the enumerated error causes.
 *   @remark
 * This function can be called from both, a user task or the OS context.
 */
static inline unsigned int rtos_getNoTaskFailure(unsigned int PID, unsigned int kindOfErr)
{
    if(--PID < PRC_NO_PROCESSES
       &&  kindOfErr < sizeOfAry(prc_processAry[PID].cntTaskFailureAry)
      )
    {
        return prc_processAry[PID].cntTaskFailureAry[kindOfErr];
    }
    else
        return UINT_MAX;

} /* End of rtos_getNoTaskFailure */



/**
 * System call to suspend a process. All currently running tasks belonging to the process
 * are aborted and the process is stopped forever (i.e. there won't be further task starts
 * or I/O driver callback invocations).\n
 *   Suspending a process of PID i is permitted only to processes of PID j>i.
 *   @param PID
 * The ID of the process to suspend. Needs to be not zero (OS process) and lower than the
 * ID of the calling process. Otherwise the calling task is aborted with exception
 * #IVR_CAUSE_TASK_ABBORTION_SYS_CALL_BAD_ARG.
 *   @remark
 * Tasks of the suspended process can continue running for a short while until their abort
 * conditions are checked the next time. The likelihood of such a continuation is little
 * and the duration is in the magnitude of a Millisecond.
 *   @remark
 * This function must be called from the user task context only. Any attempt to use it from
 * OS code will lead to a crash.
 */
static inline void rtos_suspendProcess(uint32_t PID)
{
    rtos_systemCall(PRC_SYSCALL_SUSPEND_PROCESS, PID);

} /* End of rtos_suspendProcess */

#endif  /* RTOS_INCLUDED */
